import React from "react";
import { Disclosure } from "@headlessui/react";
import { MinusSmallIcon, PlusSmallIcon } from "@heroicons/react/24/outline";

const faqs = [
  {
    question: "চুই ঝাল কি?",
    answer:
      "চুইঝাল পানের লতার মত এক ধরনের গাছ, এর শিকড় ও কান্ড খাবারে ব্যবহার হয়ে থাকে। চুইঝাল মসলা ও ঝাল হিসেবে সবচেয়ে বেশি ব্যবহৃত হয়। এটি খেতে অনেকটা আদা ও গোলমরিচের মত ঝাঝালো, রান্নার পর টুকরোগুলো চুষে বা চিবিয়ে খাওয়া হয়। ঝাল স্বাদের হলেও চুইয়ের নিজস্ব স্বাদ ও ঘ্রাণ আছে। খুলনা অঞ্চলে চুইঝালকে মসলা হিসেবে ব্যবহার করে চুইঝালের মাংস রান্না করা হয়।",
  },
  {
    question: "চুই ঝালের রান্নার বিশেষত্ব কি?",
    answer:
      "রান্নায় এর ঝাল খাবারের স্বাদ বাড়ায় আবার শরীরেরও কোনো ক্ষতি করে না। ঝোল জাতীয় সব কিছুতেই স্বাদ তৈরি করে। এদের কাণ্ড, শিকড়, পাতা, ফুল, ফলের ঔষধি গুণ আছে। চুই ঝাল দিয়ে রান্না করা তরকারিতে কড়া ঝাঁঝালো সুঘ্রাণ পাওয়া যায়। মাংস ছাড়াও ভুনা খিচুড়ি, মাছ ভুনা, বিভিন্ন রকমের তরকারীতে চুই ঝাল ব্যবহার করা হয়। ",
  },
  {
    question: "কতটুকু চুইঝালে কয়বার রান্না করা যায়?",
    answer:
      "৫০০ গ্রাম চুইঝাল দিয়ে অনায়াসেই ৮ থেকে ১০ কেজি মাংস রান্না করা যায়। তবে কেউ যদি চুইবিলাসী হয় তার হিসাব ভিন্ন। সাধারনত ১ কেজি মাংসে ৫০-৬০ গ্রাম চুইঝালই যথেষ্ট। তাই প্রতিবারে যদি ১ কেজি করে মাংস রান্না করা হয় তাহলে ৫০০ গ্রাম চুইঝাল দিয়ে খুব ভালোভাবেই ৮-১০ বার রান্না করা যাবে।",
  },
  {
    question: "চুইঝাল কিভাবে কাটব?",
    answer:
      "দুই রকম; গাছ চুইঝাল ও এটো চুইঝাল। আপনি যদি সেই রকম লেভেলের ঝাল লাভার হয়ে থাকেন তাহলে গাছ চুইঝাল দিতে পারে আপনাকে পারফেক্ট ঝালের তৃপ্তি। যত বেশি চিবতে থাকবেন তত এর থেকে ঝাল বের হতে থাকবে। তবে এটো চুইঝাল মোটা সাইজের গুলো যদি পছন্দ করে থাকেন তাহলে ঝালের পরিমাণ একটু কমবে। কিন্তু মাঝারি সাইজের এটো চুইঝাল গুলো আবার বেশ ঝাল হয়ে থাকে।",
  },
  {
    question: "দেশি ও পাহাড়ী চুইঝাল এর পার্থক্য কি?",
    answer:
      "পাহাড়ী চুইঝাল দেশের পাহাড়ী অঞ্চল অর্থাৎ চট্টগ্রাম, রাঙামাটি পার্বত্য অঞ্চলে জন্মে থাকে। এর রঙ খয়েরী অথবা লালচে সাদা, রান্না হতে বেশ সময় লাগে, খেতে মোটেও সুস্বাদু নয় এবং কাঠের মত শক্ত হয়ে থাকে। পাহাড়ী চুই এর বাহ্যিক অংশে কোনো শিকড় থাকে না। অসাধু ব্যবসায়ীরা দেশি চুই ঝাল এর ভিতর পাহাড়ী চুই মিশিয়ে কাস্টমারকে দিয়ে দেয়। সহজে বোঝার উপায় না থাকায় গ্রাহক প্রতারিত হয়ে থাকেন।",
  },
  {
    question: "কি কি ঔষধি গুণ রয়েছে চুইঝালে?",
    answer:
      "গ্যাস্ট্রিক সমস্যার সমাধান করে ও কোষ্ঠকাঠিন্য দূর করে। খাবারের রুচি বাড়াতে এবং ক্ষুধামন্দা দূর করতে কার্যকর ভূমিকা রাখে। পাকস্থলী ও অন্ত্রের প্রদাহ সারাতে চুইঝাল অনেক উপকারী। স্নায়ুবিক উত্তেজনা ও মানসিক অস্থিরতা প্রশমন করে। ঘুমের ওষুধ হিসেবে কাজ করে এবং শারীরিক দুর্বলতা কাটাতে এবং শরীরের ব্যথা সারায়। সদ্য প্রসূতি মায়েদের শরীরের ব্যথা দ্রুত কমাতে ম্যাজিকের মতো সাহায্য করে। কাশি, কফ, হাঁপানি, শ্বাসকষ্ট, ডায়রিয়া ও রক্তস্বল্পতা দূর করে। এক ইঞ্চি পরিমাণ চুই লতার সাথে আদা পিষে খেলে সর্দি সমস্যা থেকে মুক্তি পাওয়া যায়।",
  },
  // More questions...
];
const faqs2 = [
  {
    question: "চুই ঝাল কি?",
    answer:
      "চুইঝাল পানের লতার মত এক ধরনের গাছ, এর শিকড় ও কান্ড খাবারে ব্যবহার হয়ে থাকে। চুইঝাল মসলা ও ঝাল হিসেবে সবচেয়ে বেশি ব্যবহৃত হয়। এটি খেতে অনেকটা আদা ও গোলমরিচের মত ঝাঝালো, রান্নার পর টুকরোগুলো চুষে বা চিবিয়ে খাওয়া হয়। ঝাল স্বাদের হলেও চুইয়ের নিজস্ব স্বাদ ও ঘ্রাণ আছে। খুলনা অঞ্চলে চুইঝালকে মসলা হিসেবে ব্যবহার করে চুইঝালের মাংস রান্না করা হয়।",
  },
  {
    question: "এক কেজি মাংসে কতটুকু চুই ঝাল দিতে হয়?",
    answer:
      "সাধারনত ১ কেজি মাংসে ৫০-৬০ গ্রাম চুইঝালই যথেষ্ট। তাই ৫০০ গ্রাম চুইঝাল দিয়ে খুব ভালোভাবেই ৮-১০ কেজি  মাংস রান্না করা যায়"
  },
  {
    question: "চুইঝাল কিভাবে কাটব?",
    answer:
      "চুইঝাল কাটার আগে অবশ্যই ১০ থেকে ১৫ মিনিট পানিতে ভিজিয়ে রাখবেন। এরপর প্রথমত আশ বরাবর লম্বালম্বি কেটে নিবেন। তারপর প্রয়োজনমত ছোট বড় টুকরো করে নিন।",
  },
  {
    question: "চুইঝালের রান্নার বিশেষত্ব কি?",
    answer:
      "চুইঝাল দিয়ে রান্না করা তরকারিতে কড়া ঝাঁঝালো ঝাল একটা স্বাদ পাওয়া যায়। মাংস ছাড়াও ভুনা খিচুড়ি, মাছ ভুনা, বিভিন্ন রকমের রান্নায় চুইঝালের ব্যবহার এর স্বাদকে আরো বহুগুণে বাড়িয়ে দেয়।",
  },
  {
    question: "কিভাবে রান্না করব চুইঝাল দিয়ে ?",
    answer:
      "ঝোল জাতীয় যেকোন খাবারে চুইঝাল ব্যবহার করতে পারবেন। চুইঝালের ফ্লেভারটা ভালোমতো ঝোলের মধ্যে ছড়িয়ে পড়ার জন্য দুই তিন টুকরো চুই ঝাল থেতো করে দিবেন আর বাকি অংশটুকু আস্তই থাকবে। এতে করে যেমন ঝোল এর মধ্যে চুইঝালের ফ্লেভার পাবেন, আবার আলাদা করে চুইঝাল চিবিয়ে খাওয়ার মজাটাও উপভোগ করতে পারবেন।",
  },
  {
    question: "গাছ চুইঝাল এবং এটো চুইঝালের মধ্যে পার্থক্য কি?",
    answer:
      "চুইঝাল গাছের কাণ্ডকে গাছ চুইঝাল বলে। গাছ চুইঝালের ঝাঁঝ সাধারণত একটু বেশি হয়ে থাকে। গাছ চুইঝাল রান্নায় গলে না গিয়ে আস্ত থাকে। এজন্য যখন চিবিয়ে খাওয়া যায় তখনই স্বাদটা  উপভোগ করা যায়।চুই ঝাল গাছের গোড়া এবং গোড়া সংলগ্ন মোটা অথবা মাঝারি মোটা অংশকে এটো চুই ঝাল বলে। এটো চুইঝালে ঝাল এ ঝাল তুলনামূলক কম হলেও রান্নায় গলে গিয়ে গ্রেভি ফ্লেভার নিয়ে আসে। তরকারিতে দিলে নরম হয়ে যায়, তবে ঝোলের সাথে দারুন ফ্লেভার ছড়ায়। তুলনামূলক কম-ঝালযুক্ত এবং রান্নায় গলে যাওয়ার জন্য এই চুইঝালও কিন্ত বেশ সুস্বাদু এবং সবার পছন্দের তালিকায় শীর্ষে থাকে।",
  },
  {
    question: "দেশি ও পাহাড়ী চুইঝাল এর পার্থক্য কি?",
    answer:
      "পাহাড়ী চুইঝাল দেশের পাহাড়ী অঞ্চল অর্থাৎ চট্টগ্রাম, রাঙামাটি পার্বত্য অঞ্চলে জন্মে থাকে। এর রঙ খয়েরী অথবা লালচে সাদা, রান্না হতে বেশ সময় লাগে, খেতে মোটেও সুস্বাদু নয় এবং কাঠের মত শক্ত হয়ে থাকে। পাহাড়ী চুই এর বাহ্যিক অংশে কোনো শিকড় থাকে না অন্যদিকে দেশী চুইঝালের কান্ড ছোট ছোট শিকড়ে পরিপূর্ণ হয়ে থাকে এবং রান্নায় ও বেশ ঝাঁঝালো ঝাল এক ধরনের ফ্লেবার যোগ করে থাকে।",
  },
  {
    question: "কি কি ঔষধি গুণ রয়েছে চুইঝালে?",
    answer:
      "চুইঝাল গ্যাস্ট্রিক সমস্যার সমাধান করে ও কোষ্ঠকাঠিন্য দূর করে,খাবারের রুচি বাড়াতে এবং ক্ষুধামন্দা দূর করতে কার্যকর ভূমিকা রাখে। এছাড়া পাকস্থলী ও অন্ত্রের প্রদাহ কমায়, স্নায়ুবিক উত্তেজনা ও মানসিক অস্থিরতা প্রশমন করে, শারীরিক দুর্বলতা ও শরীরের ব্যথা কমায়। সদ্য প্রসূতি মায়েদের শরীরের ব্যথা দ্রুত কমাতে ম্যাজিকের মতো সাহায্য করে। কাশি, কফ, হাঁপানি, শ্বাসকষ্ট, ডায়রিয়া ও রক্তস্বল্পতা দূর করে। এছাড়াও চুই ঝাল ঘুমের ওষুধ হিসেবেও বেশ ভালো কাজ করে।",
  },
  // More questions...
];

const Faq = () => {
  return (
    <div id="faq" className="my-28">
      <h1 className="text-3xl font-bold text-center text-green-600">
        সচরাচর জিজ্ঞাস্য প্রশ্নাবলি
      </h1>
      <div className="bg-white">
        <div className="mx-auto max-w-7xl   lg:px-8 ">
          <div className="mx-auto max-w-4xl divide-y divide-gray-900/10">
            <h1 className="divide-y divide-gray-900/10"></h1>
            <dl className="mt-10 space-y-6 divide-y divide-gray-900/10">
              {faqs2.map((faq) => (
                <Disclosure as="div" key={faq.question} className="pt-6">
                  {({ open }) => (
                    <>
                      <dt>
                        <Disclosure.Button className="flex w-full items-start justify-between text-left text-gray-900">
                          <span className="text-xl font-semibold leading-7">
                            {faq.question}
                          </span>
                          <span className="ml-6 flex h-7 items-center">
                            {open ? (
                              <MinusSmallIcon
                                className="h-6 w-6"
                                aria-hidden="true"
                              />
                            ) : (
                              <PlusSmallIcon
                                className="h-6 w-6"
                                aria-hidden="true"
                              />
                            )}
                          </span>
                        </Disclosure.Button>
                      </dt>
                      <Disclosure.Panel as="dd" className="mt-2 pr-12">
                        <p className="text-base leading-7 text-gray-600">
                          {faq.answer}
                        </p>
                      </Disclosure.Panel>
                    </>
                  )}
                </Disclosure>
              ))}
            </dl>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Faq;
